apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h56xxx_pinmap.h
/*  TIM15 (AF2/AF4, per pin) */

#define GPIO_TIM15_CH1OUT_1       (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN2)   /* PA2  */
#define GPIO_TIM15_CH1OUT_2       (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN5)   /* PE5  */
#define GPIO_TIM15_CH1OUT_3       (GPIO_ALT|GPIO_AF2|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN12)  /* PC12 */

#define GPIO_TIM15_CH1NOUT_1      (GPIO_ALT|GPIO_AF4|GPIO_PORTA|GPIO_PIN1)   /* PA1  */
#define GPIO_TIM15_CH1NOUT_2      (GPIO_ALT|GPIO_AF4|GPIO_PORTE|GPIO_PIN4)   /* PE4  */

#define GPIO_TIM15_CH2OUT_1       (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN3)   /* PA3  */
#define GPIO_TIM15_CH2OUT_2       (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN6)   /* PE6  */

/*  TIM16 (AF1)  */

#define GPIO_TIM16_CH1OUT_1       (GPIO_ALT|GPIO_AF1|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN8)   /* PB8  */
#define GPIO_TIM16_CH1OUT_2       (GPIO_ALT|GPIO_AF1|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN6)   /* PF6  */
#define GPIO_TIM16_CH1NOUT_1      (GPIO_ALT|GPIO_AF1|GPIO_PORTB|GPIO_PIN6)                 /* PB6  */
#define GPIO_TIM16_CH1NOUT_2      (GPIO_ALT|GPIO_AF1|GPIO_PORTF|GPIO_PIN8)                 /* PF8  */

/*  TIM17 (AF1)  */

#define GPIO_TIM17_CH1OUT_1       (GPIO_ALT|GPIO_AF1|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN9)   /* PB9  */
#define GPIO_TIM17_CH1OUT_2       (GPIO_ALT|GPIO_AF1|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN7)   /* PF7  */
#define GPIO_TIM17_CH1NOUT_1      (GPIO_ALT|GPIO_AF1|GPIO_PORTB|GPIO_PIN7)                 /* PB7  */
#define GPIO_TIM17_CH1NOUT_2      (GPIO_ALT|GPIO_AF1|GPIO_PORTF|GPIO_PIN9)                 /* PF9  */

/* UARTs/USARTs */

/* UART4 */

#define GPIO_UART4_TX_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN12)
#define GPIO_UART4_TX_2       (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN0)
#define GPIO_UART4_TX_3       (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN9)
#define GPIO_UART4_TX_4       (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN10)
#define GPIO_UART4_TX_5       (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN1)
#define GPIO_UART4_TX_6       (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN12)
#define GPIO_UART4_TX_7       (GPIO_ALT|GPIO_AF8|GPIO_PORTH|GPIO_PIN13)

#define GPIO_UART4_RX_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN11)
#define GPIO_UART4_RX_2       (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN1)
#define GPIO_UART4_RX_3       (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN8)
#define GPIO_UART4_RX_4       (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN11)
#define GPIO_UART4_RX_5       (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN0)
#define GPIO_UART4_RX_6       (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN11)
#define GPIO_UART4_RX_7       (GPIO_ALT|GPIO_AF8|GPIO_PORTH|GPIO_PIN14)
#define GPIO_UART4_RX_8       (GPIO_ALT|GPIO_AF8|GPIO_PORTI|GPIO_PIN9)

#define GPIO_UART4_CTS_1      (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN0)
#define GPIO_UART4_CTS_2      (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN15)

#define GPIO_UART4_RTS_DE_1   (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN15)
#define GPIO_UART4_RTS_DE_2   (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN14)

/* UART5 */

#define GPIO_UART5_TX_1       (GPIO_ALT|GPIO_AF14|GPIO_PORTB|GPIO_PIN6)
#define GPIO_UART5_TX_2       (GPIO_ALT|GPIO_AF14|GPIO_PORTB|GPIO_PIN13)
#define GPIO_UART5_TX_3       (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN12)

#define GPIO_UART5_RX_1       (GPIO_ALT|GPIO_AF14|GPIO_PORTB|GPIO_PIN5)
#define GPIO_UART5_RX_2       (GPIO_ALT|GPIO_AF14|GPIO_PORTB|GPIO_PIN12)
#define GPIO_UART5_RX_3       (GPIO_ALT|GPIO_AF14|GPIO_PORTB|GPIO_PIN15)
#define GPIO_UART5_RX_4       (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN2)

#define GPIO_UART5_CTS_1      (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN9)

#define GPIO_UART5_RTS_DE_1   (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN8)

/* UART7 */

#define GPIO_UART7_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN8)
#define GPIO_UART7_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN7)
#define GPIO_UART7_TX_3       (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN15)
#define GPIO_UART7_TX_4       (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN4)

#define GPIO_UART7_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN7)
#define GPIO_UART7_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN6)
#define GPIO_UART7_RX_3       (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN8)
#define GPIO_UART7_RX_4       (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN3)

#define GPIO_UART7_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN10)
#define GPIO_UART7_CTS_2      (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN9)

#define GPIO_UART7_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN9)
#define GPIO_UART7_RTS_DE_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN8)

/* UART8 */

#define GPIO_UART8_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTH|GPIO_PIN13)
#define GPIO_UART8_TX_2       (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN1)
#define GPIO_UART8_TX_3       (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN2)

#define GPIO_UART8_RX_1       (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN0)

#define GPIO_UART8_CTS_1      (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN14)

#define GPIO_UART8_RTS_DE_1   (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN15)

/* UART12 */

#define GPIO_UART12_TX_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN10)
#define GPIO_UART12_TX_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN2)
#define GPIO_UART12_TX_3       (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN3)

#define GPIO_UART12_RX_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN9)
#define GPIO_UART12_RX_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN5)
#define GPIO_UART12_RX_3       (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN2)

#define GPIO_UART12_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN3)
#define GPIO_UART12_CTS_2      (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN8)

#define GPIO_UART12_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN5)
#define GPIO_UART12_RTS_DE_2   (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN7)

/* USART1 */

#define GPIO_USART1_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN9)
#define GPIO_USART1_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN6)
#define GPIO_USART1_TX_3       (GPIO_ALT|GPIO_AF4|GPIO_PORTD|GPIO_PIN14)

#define GPIO_USART1_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN10)
#define GPIO_USART1_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN7)
#define GPIO_USART1_RX_3       (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN15)

#define GPIO_USART1_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN8)

#define GPIO_USART1_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN11)

#define GPIO_USART1_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN12)

