apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h56xxx_pinmap.h
/* USART2 */

#define GPIO_USART2_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN2)
#define GPIO_USART2_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN5)

#define GPIO_USART2_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN3)
#define GPIO_USART2_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN6)

#define GPIO_USART2_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN4)
#define GPIO_USART2_CK_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN4)

#define GPIO_USART2_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN0)
#define GPIO_USART2_CTS_2      (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN3)

#define GPIO_USART2_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN1)
#define GPIO_USART2_RTS_DE_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN4)

/* USART3 */

#define GPIO_USART3_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN10)
#define GPIO_USART3_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN4)
#define GPIO_USART3_TX_3       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN10)
#define GPIO_USART3_TX_4       (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN8)

#define GPIO_USART3_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN11)
#define GPIO_USART3_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN5)
#define GPIO_USART3_RX_3       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN11)
#define GPIO_USART3_RX_4       (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN9)

#define GPIO_USART3_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN0)
#define GPIO_USART3_CK_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN12)
#define GPIO_USART3_CK_3       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN12)
#define GPIO_USART3_CK_4       (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN10)

#define GPIO_USART3_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN6)
#define GPIO_USART3_CTS_2      (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN13)
#define GPIO_USART3_CTS_3      (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN11)

#define GPIO_USART3_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN15)
#define GPIO_USART3_RTS_DE_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN1)
#define GPIO_USART3_RTS_DE_3   (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN14)
#define GPIO_USART3_RTS_DE_4   (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN2)
#define GPIO_USART3_RTS_DE_5   (GPIO_ALT|GPIO_AF7|GPIO_PORTD|GPIO_PIN12)

/* USART6 */

#define GPIO_USART6_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN6)
#define GPIO_USART6_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN14)

#define GPIO_USART6_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN7)
#define GPIO_USART6_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN9)

#define GPIO_USART6_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN8)
#define GPIO_USART6_CK_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN7)

#define GPIO_USART6_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN13)
#define GPIO_USART6_CTS_2      (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN15)

#define GPIO_USART6_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN8)
#define GPIO_USART6_RTS_DE_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN12)

/* USART10 */

#define GPIO_USART10_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN3)
#define GPIO_USART10_TX_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN12)

#define GPIO_USART10_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN2)
#define GPIO_USART10_RX_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN11)

#define GPIO_USART10_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTE|GPIO_PIN15)
#define GPIO_USART10_CK_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN15)

#define GPIO_USART10_CTS_1      (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN13)

#define GPIO_USART10_RTS_DE_1   (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN14)

/* USART11 */

#define GPIO_USART11_TX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN6)
#define GPIO_USART11_TX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN3)

#define GPIO_USART11_RX_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTA|GPIO_PIN7)
#define GPIO_USART11_RX_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN4)

#define GPIO_USART11_CK_1       (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN0)
#define GPIO_USART11_CK_2       (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN2)

#define GPIO_USART11_CTS_1      (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN15)
#define GPIO_USART11_CTS_2      (GPIO_ALT|GPIO_AF7|GPIO_PORTF|GPIO_PIN5)

#define GPIO_USART11_RTS_DE_1   (GPIO_ALT|GPIO_AF7|GPIO_PORTC|GPIO_PIN1)
#define GPIO_USART11_RTS_DE_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTG|GPIO_PIN11)

/* LPUART1 */

#define GPIO_LPUART1_TX_1      (GPIO_ALT|GPIO_AF3|GPIO_PORTA|GPIO_PIN9)
#define GPIO_LPUART1_TX_2      (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN6)

#define GPIO_LPUART1_RX_1      (GPIO_ALT|GPIO_AF3|GPIO_PORTA|GPIO_PIN10)
#define GPIO_LPUART1_RX_2      (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN7)

#define GPIO_LPUART1_CTS_1     (GPIO_ALT|GPIO_AF3|GPIO_PORTA|GPIO_PIN11)

#define GPIO_LPUART1_RTS_DE_1  (GPIO_ALT|GPIO_AF3|GPIO_PORTA|GPIO_PIN12)

/* USB */

#define GPIO_USB_DM           (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_FLOAT|GPIO_PORTA|GPIO_PIN11)
#define GPIO_USB_DP           (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_FLOAT|GPIO_PORTA|GPIO_PIN12)
#define GPIO_USB_SOF          (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_FLOAT|GPIO_PORTA|GPIO_PIN8)

/* ADC1 */

#define GPIO_ADC1_INP0_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN0)
#define GPIO_ADC1_INP1_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN1)
#define GPIO_ADC1_INN1_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN0)
#define GPIO_ADC1_INP2_0   (GPIO_ANALOG | GPIO_PORTF | GPIO_PIN11)
#define GPIO_ADC1_INN2_0   (GPIO_ANALOG | GPIO_PORTF | GPIO_PIN12)
#define GPIO_ADC1_INP3_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_ADC1_INN3_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADC1_INP4_0   (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN4)
#define GPIO_ADC1_INN4_0   (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN5)
#define GPIO_ADC1_INP5_0   (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_ADC1_INN5_0   (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_ADC1_INP6_0   (GPIO_ANALOG | GPIO_PORTF | GPIO_PIN12)
#define GPIO_ADC1_INP7_0   (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADC1_INP8_0   (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN5)
#define GPIO_ADC1_INP9_0   (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_ADC1_INP10_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN0)
#define GPIO_ADC1_INN10_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN1)
#define GPIO_ADC1_INP11_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN1)
#define GPIO_ADC1_INN11_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN2)
#define GPIO_ADC1_INP12_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN2)
#define GPIO_ADC1_INN12_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN3)
#define GPIO_ADC1_INP13_0  (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN3)
#define GPIO_ADC1_INP14_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN2)
#define GPIO_ADC1_INP15_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN3)
#define GPIO_ADC1_INP18_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_ADC1_INN18_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_ADC1_INP19_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)

/* ADC2 */

